{
    "queries": {
        "f19293aa-18f0-473e-b0c3-24c7b59b13ee": "Here are two questions that I've generated based on the provided context:",
        "fafdd3cf-f620-4371-8397-107463e1b3a7": "**Question 1**",
        "2ab11c88-2912-4124-b2fc-7ec073827cae": "What was the purpose of President von der Leyen's announcement in her political guidelines for the 2019-2024 Commission, according to the explanatory memorandum?",
        "0235df08-3fbc-4313-ad08-a3118bbd3255": "**Question 2**",
        "7d18d22c-1d8f-4596-8411-1ff105390cac": "Which European institution has repeatedly expressed calls for legislative action to ensure a well-functioning internal market for artificial intelligence systems (‘AI systems’), as mentioned in the explanatory memorandum?",
        "530bb13b-1534-41e8-8b6a-6972e7ea1b87": "Here are two questions that cover different aspects of the context:",
        "d9872e4c-1d54-4aa3-93e3-b7a57a667695": "Question 1:",
        "8d43b05e-50ff-40d9-b1f1-536bac281bfe": "What was the European Council's call regarding AI applications that should be considered high-risk?",
        "c7751494-0776-479e-9906-62a56fd5d287": "(Note: This question tests knowledge of specific points mentioned in the context, such as the European Council's calls and recommendations.)",
        "628b24a4-73b3-4fa4-b3e5-2a11b3ccb68f": "Question 2:",
        "74ad9b56-3969-49e0-83ad-12a31041a067": "What is one of the objectives of the proposed regulatory framework on Artificial Intelligence according to the Commission, in addition to ensuring safety and respecting fundamental rights?",
        "82ea6dc6-bdcd-4bca-8c91-8139372d1b61": "(Note: This question tests understanding of the broader goals and principles underlying the proposal, rather than specific details.)",
        "26a7cfc5-697c-48dd-be47-f00fbf30f3c8": "Here are two questions that cover different aspects of the text:",
        "e4bf6b1e-5d59-45c3-9a5f-3fb8047b0768": "**Question 1**",
        "e1072eee-94fa-4ce7-acbb-58a792d28a1f": "What is the primary approach taken by the proposal to regulate AI systems, and how does it aim to balance innovation with concerns about safety and fundamental rights?",
        "38238aaf-8fc8-48b2-8e6d-d85c07330c45": "**Question 2**",
        "c1eef68c-d8e5-498b-b0da-9b3c8a5791b5": "How does the proposal ensure consistency with existing Union legislation, particularly in relation to data protection, consumer protection, non-discrimination, and gender equality?"
    },
    "corpus": {
        "2f14feb8-2d84-4c57-b97a-a294655e74f2": "![european flag](./../../../../images/eclogo.jpg)EUROPEAN COMMISSION\n\nBrussels, 21.4.2021\n\nCOM(2021) 206 final\n\n2021/0106(COD)\n\nProposal for a\n\nREGULATION OF THE EUROPEAN PARLIAMENT AND OF THE COUNCIL\n\nLAYING DOWN HARMONISED RULES ON ARTIFICIAL INTELLIGENCE (ARTIFICIAL\nINTELLIGENCE ACT) AND AMENDING CERTAIN UNION LEGISLATIVE ACTS\n\n{SEC(2021) 167 final} - {SWD(2021) 84 final} - {SWD(2021) 85 final}\n\n  \n\nEXPLANATORY MEMORANDUM\n\n1.CONTEXT OF THE PROPOSAL\n\n1.1.Reasons for and objectives of the proposal\n\nThis explanatory memorandum accompanies the proposal for a Regulation laying\ndown harmonised rules on artificial intelligence (Artificial Intelligence\nAct). Artificial Intelligence (AI) is a fast evolving family of technologies\nthat can bring a wide array of economic and societal benefits across the\nentire spectrum of industries and social activities. By improving prediction,\noptimising operations and resource allocation, and personalising service\ndelivery, the use of artificial intelligence can support socially and\nenvironmentally beneficial outcomes and provide key competitive advantages to\ncompanies and the European economy. Such action is especially needed in high-\nimpact sectors, including climate change, environment and health, the public\nsector, finance, mobility, home affairs and agriculture. However, the same\nelements and techniques that power the socio-economic benefits of AI can also\nbring about new risks or negative consequences for individuals or the society.\nIn light of the speed of technological change and possible challenges, the EU\nis committed to strive for a balanced approach. It is in the Union interest to\npreserve the EU’s technological leadership and to ensure that Europeans can\nbenefit from new technologies developed and functioning according to Union\nvalues, fundamental rights and principles.\n\nThis proposal delivers on the political commitment by President von der Leyen,\nwho announced in her political guidelines for the 2019-2024 Commission “A\nUnion that strives for more” 1 , that the Commission would put forward\nlegislation for a coordinated European approach on the human and ethical\nimplications of AI. Following on that announcement, on 19 February 2020 the\nCommission published the White Paper on AI - A European approach to excellence\nand trust 2 . The White Paper sets out policy options on how to achieve the\ntwin objective of promoting the uptake of AI and of addressing the risks\nassociated with certain uses of such technology. This proposal aims to\nimplement the second objective for the development of an ecosystem of trust by\nproposing a legal framework for trustworthy AI. The proposal is based on EU\nvalues and fundamental rights and aims to give people and other users the\nconfidence to embrace AI-based solutions, while encouraging businesses to\ndevelop them. AI should be a tool for people and be a force for good in\nsociety with the ultimate aim of increasing human well-being. Rules for AI\navailable in the Union market or otherwise affecting people in the Union\nshould therefore be human centric, so that people can trust that the\ntechnology is used in a way that is safe and compliant with the law, including\nthe respect of fundamental rights. Following the publication of the White\nPaper, the Commission launched a broad stakeholder consultation, which was met\nwith a great interest by a large number of stakeholders who were largely\nsupportive of regulatory intervention to address the challenges and concerns\nraised by the increasing use of AI.\n\nThe proposal also responds to explicit requests from the European Parliament\n(EP) and the European Council, which have repeatedly expressed calls for\nlegislative action to ensure a well-functioning internal market for artificial\nintelligence systems (‘AI systems’) where both benefits and risks of AI are\nadequately addressed at Union level. It supports the objective of the Union\nbeing a global leader in the development of secure, trustworthy and ethical\nartificial intelligence as stated by the European Council 3 and ensures the\nprotection of ethical principles as specifically requested by the European\nParliament 4 .\n\nIn 2017, the European Council called for a ‘sense of urgency to address\nemerging trends’ including ‘issues such as artificial intelligence …, while at\nthe same time ensuring a high level of data protection, digital rights and\nethical standards’ 5 .",
        "57a7cccb-70e8-4501-9a2b-7cf64cd80f62": "The proposal also responds to explicit requests from the European Parliament\n(EP) and the European Council, which have repeatedly expressed calls for\nlegislative action to ensure a well-functioning internal market for artificial\nintelligence systems (‘AI systems’) where both benefits and risks of AI are\nadequately addressed at Union level. It supports the objective of the Union\nbeing a global leader in the development of secure, trustworthy and ethical\nartificial intelligence as stated by the European Council 3 and ensures the\nprotection of ethical principles as specifically requested by the European\nParliament 4 .\n\nIn 2017, the European Council called for a ‘sense of urgency to address\nemerging trends’ including ‘issues such as artificial intelligence …, while at\nthe same time ensuring a high level of data protection, digital rights and\nethical standards’ 5 . In its 2019 Conclusions on the Coordinated Plan on the\ndevelopment and use of artificial intelligence Made in Europe 6 , the Council\nfurther highlighted the importance of ensuring that European citizens’ rights\nare fully respected and called for a review of the existing relevant\nlegislation to make it fit for purpose for the new opportunities and\nchallenges raised by AI. The European Council has also called for a clear\ndetermination of the AI applications that should be considered high-risk 7 .\n\nThe most recent Conclusions from 21 October 2020 further called for addressing\nthe opacity, complexity, bias, a certain degree of unpredictability and\npartially autonomous behaviour of certain AI systems, to ensure their\ncompatibility with fundamental rights and to facilitate the enforcement of\nlegal rules 8 .\n\nThe European Parliament has also undertaken a considerable amount of work in\nthe area of AI. In October 2020, it adopted a number of resolutions related to\nAI, including on ethics 9 , liability 10 and copyright 11 . In 2021, those\nwere followed by resolutions on AI in criminal matters 12 and in education,\nculture and the audio-visual sector 13 . The EP Resolution on a Framework of\nEthical Aspects of Artificial Intelligence, Robotics and Related Technologies\nspecifically recommends to the Commission to propose legislative action to\nharness the opportunities and benefits of AI, but also to ensure protection of\nethical principles. The resolution includes a text of the legislative proposal\nfor a regulation on ethical principles for the development, deployment and use\nof AI, robotics and related technologies. In accordance with the political\ncommitment made by President von der Leyen in her Political Guidelines as\nregards resolutions adopted by the European Parliament under Article 225 TFEU,\nthis proposal takes into account the aforementioned resolution of the European\nParliament in full respect of proportionality, subsidiarity and better law\nmaking principles.\n\nAgainst this political context, the Commission puts forward the proposed\nregulatory framework on Artificial Intelligence with the following specific\nobjectives:\n\n·ensure that AI systems placed on the Union market and used are safe and\nrespect existing law on fundamental rights and Union values;\n\n·ensure legal certainty to facilitate investment and innovation in AI;\n\n·enhance governance and effective enforcement of existing law on fundamental\nrights and safety requirements applicable to AI systems;\n\n·facilitate the development of a single market for lawful, safe and\ntrustworthy AI applications and prevent market fragmentation.\n\nTo achieve those objectives, this proposal presents a balanced and\nproportionate horizontal regulatory approach to AI that is limited to the\nminimum necessary requirements to address the risks and problems linked to AI,\nwithout unduly constraining or hindering technological development or\notherwise disproportionately increasing the cost of placing AI solutions on\nthe market. The proposal sets a robust and flexible legal framework. On the\none hand, it is comprehensive and future-proof in its fundamental regulatory\nchoices, including the principle-based requirements that AI systems should\ncomply with. On the other hand, it puts in place a proportionate regulatory\nsystem centred on a well-defined risk-based regulatory approach that does not\ncreate unnecessary restrictions to trade, whereby legal intervention is\ntailored to those concrete situations where there is a justified cause for\nconcern or where such concern can reasonably be anticipated in the near\nfuture. At the same time, the legal framework includes flexible mechanisms\nthat enable it to be dynamically adapted as the technology evolves and new\nconcerning situations emerge.\n\nThe proposal sets harmonised rules for the development, placement on the\nmarket and use of AI systems in the Union following a proportionate risk-based\napproach. It proposes a single future-proof definition of AI. Certain\nparticularly harmful AI practices are prohibited as contravening Union values,\nwhile specific restrictions and safeguards are proposed in relation to certain\nuses of remote biometric identification systems for the purpose of law\nenforcement.",
        "981ff1c9-88d3-48e6-a6c0-89261c4c980b": "On the other hand, it puts in place a proportionate regulatory\nsystem centred on a well-defined risk-based regulatory approach that does not\ncreate unnecessary restrictions to trade, whereby legal intervention is\ntailored to those concrete situations where there is a justified cause for\nconcern or where such concern can reasonably be anticipated in the near\nfuture. At the same time, the legal framework includes flexible mechanisms\nthat enable it to be dynamically adapted as the technology evolves and new\nconcerning situations emerge.\n\nThe proposal sets harmonised rules for the development, placement on the\nmarket and use of AI systems in the Union following a proportionate risk-based\napproach. It proposes a single future-proof definition of AI. Certain\nparticularly harmful AI practices are prohibited as contravening Union values,\nwhile specific restrictions and safeguards are proposed in relation to certain\nuses of remote biometric identification systems for the purpose of law\nenforcement. The proposal lays down a solid risk methodology to define “high-\nrisk” AI systems that pose significant risks to the health and safety or\nfundamental rights of persons. Those AI systems will have to comply with a set\nof horizontal mandatory requirements for trustworthy AI and follow conformity\nassessment procedures before those systems can be placed on the Union market.\nPredictable, proportionate and clear obligations are also placed on providers\nand users of those systems to ensure safety and respect of existing\nlegislation protecting fundamental rights throughout the whole AI systems’\nlifecycle. For some specific AI systems, only minimum transparency obligations\nare proposed, in particular when chatbots or ‘deep fakes’ are used.\n\nThe proposed rules will be enforced through a governance system at Member\nStates level, building on already existing structures, and a cooperation\nmechanism at Union level with the establishment of a European Artificial\nIntelligence Board. Additional measures are also proposed to support\ninnovation, in particular through AI regulatory sandboxes and other measures\nto reduce the regulatory burden and to support Small and Medium-Sized\nEnterprises (‘SMEs’) and start-ups.\n\n1.2.Consistency with existing policy provisions in the policy area\n\nThe horizontal nature of the proposal requires full consistency with existing\nUnion legislation applicable to sectors where high-risk AI systems are already\nused or likely to be used in the near future.\n\nConsistency is also ensured with the EU Charter of Fundamental Rights and the\nexisting secondary Union legislation on data protection, consumer protection,\nnon-discrimination and gender equality. The proposal is without prejudice and\ncomplements the General Data Protection Regulation (Regulation (EU) 2016/679)\nand the Law Enforcement Directive (Directive (EU) 2016/680) with a set of\nharmonised rules applicable to the design, development and use of certain\nhigh-risk AI systems and restrictions on certain uses of remote biometric\nidentification systems. Furthermore, the proposal complements existing Union\nlaw on non-discrimination with specific requirements that aim to minimise the\nrisk of algorithmic discrimination, in particular in relation to the design\nand the quality of data sets used for the development of AI systems\ncomplemented with obligations for testing, risk management, documentation and\nhuman oversight throughout the AI systems’ lifecycle. The proposal is without\nprejudice to the application of Union competition law.\n\nAs regards high-risk AI systems which are safety components of products, this\nproposal will be integrated into the existing sectoral safety legislation to\nensure consistency, avoid duplications and minimise additional burdens. In\nparticular, as regards high-risk AI systems related to products covered by the\nNew Legislative Framework (NLF) legislation (e.g. machinery, medical devices,\ntoys), the requirements for AI systems set out in this proposal will be\nchecked as part of the existing conformity assessment procedures under the\nrelevant NLF legislation. With regard to the interplay of requirements, while\nthe safety risks specific to AI systems are meant to be covered by the\nrequirements of this proposal, NLF legislation aims at ensuring the overall\nsafety of the final product and therefore may contain specific requirements\nregarding the safe integration of an AI system into the final product. The\nproposal for a Machinery Regulation, which is adopted on the same day as this\nproposal fully reflects this approach. As regards high-risk AI systems related\nto products covered by relevant Old Approach legislation (e.g. aviation,\ncars), this proposal would not directly apply. However, the ex-ante essential\nrequirements for high-risk AI systems set out in this proposal will have to be\ntaken into account when adopting relevant implementing or delegated\nlegislation under those acts."
    },
    "relevant_docs": {
        "f19293aa-18f0-473e-b0c3-24c7b59b13ee": [
            "2f14feb8-2d84-4c57-b97a-a294655e74f2"
        ],
        "fafdd3cf-f620-4371-8397-107463e1b3a7": [
            "2f14feb8-2d84-4c57-b97a-a294655e74f2"
        ],
        "2ab11c88-2912-4124-b2fc-7ec073827cae": [
            "2f14feb8-2d84-4c57-b97a-a294655e74f2"
        ],
        "0235df08-3fbc-4313-ad08-a3118bbd3255": [
            "2f14feb8-2d84-4c57-b97a-a294655e74f2"
        ],
        "7d18d22c-1d8f-4596-8411-1ff105390cac": [
            "2f14feb8-2d84-4c57-b97a-a294655e74f2"
        ],
        "530bb13b-1534-41e8-8b6a-6972e7ea1b87": [
            "57a7cccb-70e8-4501-9a2b-7cf64cd80f62"
        ],
        "d9872e4c-1d54-4aa3-93e3-b7a57a667695": [
            "57a7cccb-70e8-4501-9a2b-7cf64cd80f62"
        ],
        "8d43b05e-50ff-40d9-b1f1-536bac281bfe": [
            "57a7cccb-70e8-4501-9a2b-7cf64cd80f62"
        ],
        "c7751494-0776-479e-9906-62a56fd5d287": [
            "57a7cccb-70e8-4501-9a2b-7cf64cd80f62"
        ],
        "628b24a4-73b3-4fa4-b3e5-2a11b3ccb68f": [
            "57a7cccb-70e8-4501-9a2b-7cf64cd80f62"
        ],
        "74ad9b56-3969-49e0-83ad-12a31041a067": [
            "57a7cccb-70e8-4501-9a2b-7cf64cd80f62"
        ],
        "82ea6dc6-bdcd-4bca-8c91-8139372d1b61": [
            "57a7cccb-70e8-4501-9a2b-7cf64cd80f62"
        ],
        "26a7cfc5-697c-48dd-be47-f00fbf30f3c8": [
            "981ff1c9-88d3-48e6-a6c0-89261c4c980b"
        ],
        "e4bf6b1e-5d59-45c3-9a5f-3fb8047b0768": [
            "981ff1c9-88d3-48e6-a6c0-89261c4c980b"
        ],
        "e1072eee-94fa-4ce7-acbb-58a792d28a1f": [
            "981ff1c9-88d3-48e6-a6c0-89261c4c980b"
        ],
        "38238aaf-8fc8-48b2-8e6d-d85c07330c45": [
            "981ff1c9-88d3-48e6-a6c0-89261c4c980b"
        ],
        "c1eef68c-d8e5-498b-b0da-9b3c8a5791b5": [
            "981ff1c9-88d3-48e6-a6c0-89261c4c980b"
        ]
    },
    "mode": "text"
}